---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet
source: html/2abe0acc-7515-71da-2639-76377ac49e92.htm
---
# DistributionSysTypeSet Methods

Removes every DistributionSys type from the set, rendering it empty.